## Pandas Tutorials for Beginners

In [1]:
import pandas as pd
import numpy as np

# # How to create Dictionary Data using Notebook

In [36]:
data={"Name":["Dileep Kumar Patel","Rohit Kumar Singh","Somya Singh","Maya Sing","Durga sing"],
        "Age":[25,30,40,50,32],
      "Profile":["Developer","Graphics Designer","Front End Engineer","Python Developer","Java Developer"],
      "Location":["Hyderabad","New Delhi","Kolkata","Pune","Bangalore"]
     }
df = pd.DataFrame(data)
df

                 Name  Age             Profile   Location
0  Dileep Kumar Patel   25           Developer  Hyderabad
1   Rohit Kumar Singh   30   Graphics Designer  New Delhi
2         Somya Singh   40  Front End Engineer    Kolkata
3           Maya Sing   50    Python Developer       Pune
4          Durga sing   32      Java Developer  Bangalore

In [31]:
df

                 Name  Age             Profile   Location
0  Dileep Kumar Patel   25           Developer  Hyderabad
1   Rohit Kumar Singh   30   Graphics Designer  New Delhi
2         Somya Singh   40  Front End Engineer    Kolkata
3           Maya Sing   50    Python Developer       Pune
4          Durga sing   32      Java Developer  Bangalore

In [4]:
df

                 Name  Age             Profile   Location
0  Dileep Kumar Patel   25           Developer  Hyderabad
1   Rohit Kumar Singh   30   Graphics Designer  New Delhi
2         Somya Singh   40  Front End Engineer    Kolkata
3           Maya Sing   50    Python Developer       Pune
4          Durga sing   32      Java Developer  Bangalore

## Writing csv file using pandas

In [9]:
df.to_csv("Detail.csv",index=False)

## Reading csv file using pandas

In [16]:
newdf=pd.read_csv("Detail.csv")

In [39]:
newdf.head(2)   ## Write code for result display first two from top

                 Name  Age            Profile   Location
0  Dileep Kumar Patel   25          Developer  Hyderabad
1   Rohit Kumar Singh   30  Graphics Designer  New Delhi

In [30]:
newdf=pd.read_csv("Detail.csv")

In [40]:
newdf.tail(3) ## Write code for result display bottom 3 rows

          Name  Age             Profile   Location
2  Somya Singh   40  Front End Engineer    Kolkata
3    Maya Sing   50    Python Developer       Pune
4   Durga sing   32      Java Developer  Bangalore

## Details analysis by pandas

In [37]:
newdf.describe()

             Age
count   5.000000
mean   35.400000
std     9.787747
min    25.000000
25%    30.000000
50%    32.000000
75%    40.000000
max    50.000000

## Transpose using pandas

In [33]:
newdf.T

,0,1,2,3,4
Name,Dileep Kumar Patel,Rohit Kumar Singh,Somya Singh,Maya Sing,Durga sing
Age,25,30,40,50,32
Profile,Developer,Graphics Designer,Front End Engineer,Python Developer,Java Developer
Location,Hyderabad,New Delhi,Kolkata,Pune,Bangalore

In [35]:
newdf.describe()

             Age
count   5.000000
mean   35.400000
std     9.787747
min    25.000000
25%    30.000000
50%    32.000000
75%    40.000000
max    50.000000